account/controllers/OrderController.php

INSERT INTO `order` (`client_id`, `service_id`, `car_id`, `status`, `date`, `personal_price`, `created_at`, `updated_at`) VALUES (1, 2, 2, 1, '2025-05-19 13:35:00', 14400, NULL, NULL)
---
    public function actionCreate()
    {
        $model = new Order();

        $model->client_id = Yii::$app->user->identity->id;

        if ($this->request->isPost) {
            if ($model->load($this->request->post())) {
                $discount = $model->client?->promo;
                $discountValue = $discount ? $discount->discount : 0;

                $servicePrice = $model->service?->price;

                $personalPrice = $servicePrice - $servicePrice / 100 * $discountValue;

                $model->personal_price = $personalPrice;

                $model->save();

SELECT * FROM `order` WHERE `id`='4'
---
    protected function findModel($id)
    {
        if (($model = Order::findOne(['id' => $id])) !== null) {