account/controllers/SiteController.php

    public function actionIndex()
    {
        $user = Yii::$app->user->identity;
        $activeBookings = Order::find()
            ->where(['client_id' => $user->id])
            ->orderBy(['date' => SORT_ASC])
            ->limit(5)
            ->all();

        $cars = Car::find()->where(['user_id' => $user->id])->all();

        $reviews = Review::find()->select('rating')->where(['user_id' => $user->id])->column();
---
SELECT * FROM `order` WHERE `client_id`=1 ORDER BY `date` LIMIT 5
SELECT * FROM `car` WHERE `user_id`=1
SELECT `rating` FROM `review` WHERE `user_id`=1