account/views/order/_form.php

SELECT * FROM `service`
SELECT * FROM `car` WHERE `user_id`=1
SELECT * FROM `order_status`
---
            'value' => "{$model->client->name} {$model->client->surname} {$model->client->patronymic}",
    ]) ?>

    <?= $form->field($model, 'service_id')->dropDownList([
            ArrayHelper::map(Service::find()->all(), 'id', 'name'),
    ]) ?>

    <?= $form->field($model, 'car_id')->dropDownList([
        ArrayHelper::map(Car::find()->where(['user_id' => $model->client_id])->all(), 'id', 'name'),
    ]) ?>

    <?= $form->field($model, 'status')->dropDownList([
            ArrayHelper::map(OrderStatus::find()->all(), 'id', 'name'),
    ]) ?>